Revit 2027 API
BuiltInFailures.RevisionCloudFailures.ModifyingIssuedRevisionCloudOnUpgrade Property
 During upgrade, an issued revision cloud was moved. Please double check the revision cloud to ensure it is located in the correct place.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModifyingIssuedRevisionCloudOnUpgrade { get; }
Public Shared ReadOnly Property ModifyingIssuedRevisionCloudOnUpgrade As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModifyingIssuedRevisionCloudOnUpgrade {
	FailureDefinitionId^ get ();
}
static member ModifyingIssuedRevisionCloudOnUpgrade : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace